app/views/users/show.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1
---
  <div class="span8">
      <% if @user.posts.any? %>