app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "question", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 05 Jun 2013 02:13:02 UTC +00:00], ["question", "Hello Kristina!"], ["updated_at", Wed, 05 Jun 2013 02:13:02 UTC +00:00], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(params[:post])
        if @post.save