app/controllers/sessions_controller.rb

  def create
      user = User.find_by_email(email: params[:session][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'zudec01@gmail.com' LIMIT 1