app/controllers/users_controller.rb

  def show
      @user = User.find(params[:id])
      @posts = @user.posts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY posts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1